import type { Category } from '@/shared/types';

export const categories: Category[] = [
  {
    id: 20,
    name: "Материалы ВСП - Распродажа!"
  },
  {
    id: 41,
    name: "Стрелочные переводы - комплектующие"
  },
  {
    id: 69,
    name: "Железнодорожные накладки"
  },
  {
    id: 71,
    name: "Железнодорожные прокладки"
  },
  {
    id: 70,
    name: "Железнодорожные подкладки"
  },
  {
    id: 42,
    name: "Железнодорожная изоляция"
  },
  {
    id: 19,
    name: "ЖД крепеж",
    children: [
      { id: 68, name: "Клемма ПК" },
      { id: 64, name: "Противоугоны" },
      { id: 58, name: "ЖД болты" },
      { id: 60, name: "ЖД шайбы" },
      { id: 59, name: "ЖД гайки" },
      { id: 61, name: "ЖД шурупы" },
      { id: 67, name: "Костыль путевой" },
      { id: 28, name: "Скрепления АРС" },
      { id: 34, name: "Скрепления ЖБР" },
      { id: 53, name: "Cкрепления КБ" }
    ]
  },
  {
    id: 24,
    name: "Железнодорожные рельсы",
    children: [
      { id: 33, name: "Рамные рельсы" },
      { id: 29, name: "Переходные рельсы" },
      { id: 25, name: "Рельсы 12,5 метров" },
      { id: 26, name: "Рельсы 25 метров" },
      { id: 30, name: "Рельсы 6, 8, 11 метров" },
      { id: 31, name: "Рельсы Р50" },
      { id: 27, name: "Рельсы Р65" },
      { id: 39, name: "Рельсы КР" },
      { id: 36, name: "Рельсы Р18" },
      { id: 38, name: "Трамвайные рельсы" },
      { id: 37, name: "Другие марки рельс" }
    ]
  },
  {
    id: 21,
    name: "Железнодорожные шпалы",
    children: [
      { id: 22, name: "Железобетонные шпалы" },
      { id: 35, name: "Деревянные шпалы" }
    ]
  },
  {
    id: 40,
    name: "Вагонные запчасти",
    children: [
      { id: 63, name: "Локомотивные колодки" },
      { id: 56, name: "Вагонная тележка" },
      { id: 65, name: "Рама боковая" },
      { id: 55, name: "Балка надрессорная" },
      { id: 62, name: "Колесные пары" },
      { id: 57, name: "Вагонные оси" },
      { id: 54, name: "Автосцепка СА-3" }
    ]
  },
  {
    id: 32,
    name: "Путевой инструмент",
    children: [
      { id: 66, name: "Тормозной башмак" }
    ]
  }
];
